YCSB-outputs/hbase-exec-15-1000000-b-16-rf_3.txt
/usr/local/openjdk-11/bin/java -cp //opt/hbase-2.2.7-client/conf:/opt/ycsb/hbase2-binding/conf:/opt/ycsb/conf:/opt/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/opt/ycsb/lib/core-0.18.0-SNAPSHOT.jar:/opt/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/opt/ycsb/lib/HdrHistogram-2.1.4.jar:/opt/ycsb/lib/jackson-core-asl-1.9.4.jar:/opt/ycsb/hbase2-binding/lib/commons-logging-1.2.jar:/opt/ycsb/hbase2-binding/lib/hbase2-binding-0.18.0-SNAPSHOT.jar:/opt/ycsb/hbase2-binding/lib/findbugs-annotations-1.3.9-1.jar:/opt/ycsb/hbase2-binding/lib/slf4j-api-1.7.25.jar:/opt/ycsb/hbase2-binding/lib/audience-annotations-0.5.0.jar:/opt/ycsb/hbase2-binding/lib/log4j-1.2.17.jar:/opt/ycsb/hbase2-binding/lib/htrace-core4-4.1.0-incubating.jar:/opt/ycsb/hbase2-binding/lib/hbase-shaded-client-2.2.3.jar:/opt/ycsb/hbase2-binding/lib/slf4j-log4j12-1.7.25.jar site.ycsb.Client -db site.ycsb.db.hbase2.HBaseClient2 -s -P /opt/ycsb/workloads/workloadb -p table=usertable -p columnfamily=family -p recordcount=1000000 -p operationcount=10000 -t
Command line: -db site.ycsb.db.hbase2.HBaseClient2 -s -P /opt/ycsb/workloads/workloadb -p table=usertable -p columnfamily=family -p recordcount=1000000 -p operationcount=10000 -t
YCSB Client 0.18.0-SNAPSHOT

Loading workload...
Starting test.
2021-09-12 09:50:15:420 0 sec: 0 operations; est completion in 0 second 
2021-09-12 09:50:15,499 WARN  [Thread-3] util.NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by org.apache.hadoop.security.authentication.util.KerberosUtil (file:/opt/ycsb/hbase2-binding/lib/hbase-shaded-client-2.2.3.jar) to method sun.security.krb5.Config.getInstance()
WARNING: Please consider reporting this to the maintainers of org.apache.hadoop.security.authentication.util.KerberosUtil
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
2021-09-12 09:50:15,844 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x204ac3b1] zookeeper.ZooKeeper: Client environment:zookeeper.version=3.4.10-39d3a4f269333c922ed3db283be479f9deacaa0f, built on 03/23/2017 10:13 GMT
2021-09-12 09:50:15,844 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x204ac3b1] zookeeper.ZooKeeper: Client environment:host.name=85bbf37f4576
2021-09-12 09:50:15,844 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x204ac3b1] zookeeper.ZooKeeper: Client environment:java.version=11.0.12
2021-09-12 09:50:15,844 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x204ac3b1] zookeeper.ZooKeeper: Client environment:java.vendor=Oracle Corporation
2021-09-12 09:50:15,844 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x204ac3b1] zookeeper.ZooKeeper: Client environment:java.home=/usr/local/openjdk-11
2021-09-12 09:50:15,845 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x204ac3b1] zookeeper.ZooKeeper: Client environment:java.class.path=//opt/hbase-2.2.7-client/conf:/opt/ycsb/hbase2-binding/conf:/opt/ycsb/conf:/opt/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/opt/ycsb/lib/core-0.18.0-SNAPSHOT.jar:/opt/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/opt/ycsb/lib/HdrHistogram-2.1.4.jar:/opt/ycsb/lib/jackson-core-asl-1.9.4.jar:/opt/ycsb/hbase2-binding/lib/commons-logging-1.2.jar:/opt/ycsb/hbase2-binding/lib/hbase2-binding-0.18.0-SNAPSHOT.jar:/opt/ycsb/hbase2-binding/lib/findbugs-annotations-1.3.9-1.jar:/opt/ycsb/hbase2-binding/lib/slf4j-api-1.7.25.jar:/opt/ycsb/hbase2-binding/lib/audience-annotations-0.5.0.jar:/opt/ycsb/hbase2-binding/lib/log4j-1.2.17.jar:/opt/ycsb/hbase2-binding/lib/htrace-core4-4.1.0-incubating.jar:/opt/ycsb/hbase2-binding/lib/hbase-shaded-client-2.2.3.jar:/opt/ycsb/hbase2-binding/lib/slf4j-log4j12-1.7.25.jar
2021-09-12 09:50:15,845 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x204ac3b1] zookeeper.ZooKeeper: Client environment:java.library.path=/usr/java/packages/lib:/usr/lib64:/lib64:/lib:/usr/lib
2021-09-12 09:50:15,845 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x204ac3b1] zookeeper.ZooKeeper: Client environment:java.io.tmpdir=/tmp
2021-09-12 09:50:15,845 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x204ac3b1] zookeeper.ZooKeeper: Client environment:java.compiler=<NA>
2021-09-12 09:50:15,846 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x204ac3b1] zookeeper.ZooKeeper: Client environment:os.name=Linux
2021-09-12 09:50:15,846 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x204ac3b1] zookeeper.ZooKeeper: Client environment:os.arch=amd64
2021-09-12 09:50:15,846 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x204ac3b1] zookeeper.ZooKeeper: Client environment:os.version=4.19.0-17-amd64
2021-09-12 09:50:15,846 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x204ac3b1] zookeeper.ZooKeeper: Client environment:user.name=root
2021-09-12 09:50:15,846 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x204ac3b1] zookeeper.ZooKeeper: Client environment:user.home=/root
2021-09-12 09:50:15,846 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x204ac3b1] zookeeper.ZooKeeper: Client environment:user.dir=/
2021-09-12 09:50:15,851 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x204ac3b1] zookeeper.ZooKeeper: Initiating client connection, connectString=hmaster:2181,hregion1:2181,hregion2:2181 sessionTimeout=90000 watcher=org.apache.hadoop.hbase.zookeeper.ReadOnlyZKClient$$Lambda$83/0x0000000840145c40@60be07c4
2021-09-12 09:50:15,892 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x204ac3b1-SendThread(hbase_hmaster.1.si7tj6afc7veo7u7y93xumum0.pi-cluster-net:2181)] zookeeper.ClientCnxn: Opening socket connection to server hbase_hmaster.1.si7tj6afc7veo7u7y93xumum0.pi-cluster-net/10.0.2.16:2181. Will not attempt to authenticate using SASL (unknown error)
2021-09-12 09:50:15,907 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x204ac3b1-SendThread(hbase_hmaster.1.si7tj6afc7veo7u7y93xumum0.pi-cluster-net:2181)] zookeeper.ClientCnxn: Socket connection established to hbase_hmaster.1.si7tj6afc7veo7u7y93xumum0.pi-cluster-net/10.0.2.16:2181, initiating session
2021-09-12 09:50:15,925 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x204ac3b1-SendThread(hbase_hmaster.1.si7tj6afc7veo7u7y93xumum0.pi-cluster-net:2181)] zookeeper.ClientCnxn: Session establishment complete on server hbase_hmaster.1.si7tj6afc7veo7u7y93xumum0.pi-cluster-net/10.0.2.16:2181, sessionid = 0x7bd6d642bb0019, negotiated timeout = 90000
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2021-09-12 09:50:25:375 10 sec: 341 operations; 34.1 current ops/sec; est completion in 4 minutes [READ: Count=329, Max=215423, Min=7152, Avg=25751.87, 90=33055, 99=161919, 99.9=215423, 99.99=215423] [UPDATE: Count=12, Max=74047, Min=10480, Avg=22388.33, 90=28351, 99=74047, 99.9=74047, 99.99=74047] 
2021-09-12 09:50:35:375 20 sec: 860 operations; 51.9 current ops/sec; est completion in 3 minutes [READ: Count=494, Max=120703, Min=6760, Avg=19238.24, 90=28319, 99=64127, 99.9=120703, 99.99=120703] [UPDATE: Count=25, Max=67135, Min=11536, Avg=17743.2, 90=21279, 99=67135, 99.9=67135, 99.99=67135] 
2021-09-12 09:50:45:375 30 sec: 1373 operations; 51.3 current ops/sec; est completion in 3 minutes [READ: Count=499, Max=229631, Min=6592, Avg=19504.35, 90=28671, 99=65727, 99.9=229631, 99.99=229631] [UPDATE: Count=14, Max=22463, Min=11736, Avg=16280.29, 90=21487, 99=22463, 99.9=22463, 99.99=22463] 
2021-09-12 09:50:55:375 40 sec: 1874 operations; 50.1 current ops/sec; est completion in 2 minutes [READ: Count=477, Max=131711, Min=6064, Avg=18944.83, 90=28159, 99=57503, 99.9=131711, 99.99=131711] [UPDATE: Count=25, Max=543231, Min=11296, Avg=38055.2, 90=22303, 99=543231, 99.9=543231, 99.99=543231] 
2021-09-12 09:51:05:375 50 sec: 2184 operations; 31 current ops/sec; est completion in 2 minutes [READ: Count=290, Max=2553855, Min=6184, Avg=27018.66, 90=28143, 99=72575, 99.9=2553855, 99.99=2553855] [UPDATE: Count=19, Max=85951, Min=11312, Avg=20090.95, 90=21375, 99=85951, 99.9=85951, 99.99=85951] 
2021-09-12 09:51:15:375 60 sec: 2670 operations; 48.6 current ops/sec; est completion in 2 minutes [READ: Count=459, Max=2514943, Min=6228, Avg=23768.27, 90=27999, 99=45791, 99.9=2514943, 99.99=2514943] [UPDATE: Count=27, Max=28767, Min=10448, Avg=17244.44, 90=24815, 99=28767, 99.9=28767, 99.99=28767] 
2021-09-12 09:51:16,176 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x204ac3b1] zookeeper.ZooKeeper: Session: 0x7bd6d642bb0019 closed
2021-09-12 09:51:16,181 INFO  [ReadOnlyZKClient-hmaster:2181,hregion1:2181,hregion2:2181@0x204ac3b1-EventThread] zookeeper.ClientCnxn: EventThread shut down for session: 0x7bd6d642bb0019
2021-09-12 09:51:25:375 70 sec: 2834 operations; 16.4 current ops/sec; est completion in 2 minutes [READ: Count=148, Max=183551, Min=6784, Avg=19538, 90=29103, 99=48575, 99.9=183551, 99.99=183551] [UPDATE: Count=16, Max=5292031, Min=12440, Avg=345306.25, 90=17263, 99=5292031, 99.9=5292031, 99.99=5292031] 
2021-09-12 09:51:35:375 80 sec: 2856 operations; 2.2 current ops/sec; est completion in 3 minutes [READ: Count=21, Max=6299647, Min=9696, Avg=322124, 90=31967, 99=6299647, 99.9=6299647, 99.99=6299647] [UPDATE: Count=1, Max=2889727, Min=2887680, Avg=2888704, 90=2889727, 99=2889727, 99.9=2889727, 99.99=2889727] 
2021-09-12 09:51:45:376 90 sec: 3166 operations; 31 current ops/sec; est completion in 3 minutes [READ: Count=290, Max=6500351, Min=6080, Avg=41139.21, 90=30463, 99=68223, 99.9=6500351, 99.99=6500351] [UPDATE: Count=20, Max=21663, Min=10888, Avg=16645.4, 90=18287, 99=21663, 99.9=21663, 99.99=21663] 
2021-09-12 09:51:55:375 100 sec: 3745 operations; 57.9 current ops/sec; est completion in 2 minutes [READ: Count=554, Max=66239, Min=6220, Avg=17272.67, 90=27279, 99=41215, 99.9=62207, 99.99=66239] [UPDATE: Count=25, Max=20015, Min=10920, Avg=16032.48, 90=18703, 99=20015, 99.9=20015, 99.99=20015] 
2021-09-12 09:52:05:375 110 sec: 4253 operations; 50.8 current ops/sec; est completion in 2 minutes [READ: Count=473, Max=122815, Min=6368, Avg=18609.67, 90=29247, 99=43839, 99.9=122815, 99.99=122815] [UPDATE: Count=35, Max=616959, Min=11376, Avg=33336.11, 90=18687, 99=616959, 99.9=616959, 99.99=616959] 
2021-09-12 09:52:15:375 120 sec: 4643 operations; 39 current ops/sec; est completion in 2 minutes [READ: Count=367, Max=3033087, Min=6256, Avg=25731.41, 90=27647, 99=35999, 99.9=3033087, 99.99=3033087] [UPDATE: Count=23, Max=105279, Min=10840, Avg=20790.96, 90=22399, 99=105279, 99.9=105279, 99.99=105279] 
2021-09-12 09:52:25:375 130 sec: 5081 operations; 43.8 current ops/sec; est completion in 2 minutes [READ: Count=415, Max=49279, Min=6184, Avg=17268.52, 90=26383, 99=37727, 99.9=49279, 99.99=49279] [UPDATE: Count=23, Max=289279, Min=9984, Avg=30137.57, 90=20799, 99=289279, 99.9=289279, 99.99=289279] 
2021-09-12 09:52:35:375 140 sec: 5571 operations; 49 current ops/sec; est completion in 1 minute [READ: Count=471, Max=170751, Min=6668, Avg=18078.6, 90=27743, 99=43167, 99.9=170751, 99.99=170751] [UPDATE: Count=19, Max=3336191, Min=11896, Avg=191669.26, 90=22367, 99=3336191, 99.9=3336191, 99.99=3336191] 
2021-09-12 09:52:45:375 150 sec: 6183 operations; 61.2 current ops/sec; est completion in 1 minute [READ: Count=583, Max=66303, Min=6152, Avg=16264.9, 90=26111, 99=35711, 99.9=49727, 99.99=66303] [UPDATE: Count=29, Max=22495, Min=10696, Avg=16864.55, 90=19215, 99=22495, 99.9=22495, 99.99=22495] 
2021-09-12 09:52:55:375 160 sec: 6784 operations; 60.1 current ops/sec; est completion in 1 minute [READ: Count=566, Max=86527, Min=5640, Avg=16590.27, 90=25871, 99=35263, 99.9=53823, 99.99=86527] [UPDATE: Count=35, Max=26143, Min=11600, Avg=17181.94, 90=21119, 99=26143, 99.9=26143, 99.99=26143] 
2021-09-12 09:53:05:375 170 sec: 7400 operations; 61.6 current ops/sec; est completion in 1 minute [READ: Count=584, Max=59807, Min=5900, Avg=16177.75, 90=25983, 99=34271, 99.9=38175, 99.99=59807] [UPDATE: Count=32, Max=24559, Min=9832, Avg=16648.88, 90=20991, 99=24559, 99.9=24559, 99.99=24559] 
2021-09-12 09:53:15:375 180 sec: 8038 operations; 63.8 current ops/sec; est completion in 44 seconds [READ: Count=601, Max=63231, Min=5596, Avg=15565.89, 90=25055, 99=32351, 99.9=44895, 99.99=63231] [UPDATE: Count=37, Max=38687, Min=11328, Avg=17432.65, 90=19967, 99=38687, 99.9=38687, 99.99=38687] 
2021-09-12 09:53:25:375 190 sec: 8654 operations; 61.6 current ops/sec; est completion in 30 seconds [READ: Count=583, Max=86335, Min=5540, Avg=16194.17, 90=25199, 99=36031, 99.9=83583, 99.99=86335] [UPDATE: Count=33, Max=25199, Min=10624, Avg=16555.88, 90=20319, 99=25199, 99.9=25199, 99.99=25199] 
2021-09-12 09:53:35:375 200 sec: 9241 operations; 58.7 current ops/sec; est completion in 17 seconds [READ: Count=554, Max=131455, Min=5384, Avg=16831.53, 90=25919, 99=37855, 99.9=115071, 99.99=131455] [UPDATE: Count=33, Max=119103, Min=11560, Avg=19942.18, 90=20335, 99=119103, 99.9=119103, 99.99=119103] 
2021-09-12 09:53:45:375 210 sec: 9824 operations; 58.3 current ops/sec; est completion in 4 second [READ: Count=555, Max=122367, Min=5844, Avg=17196.2, 90=26063, 99=53343, 99.9=85951, 99.99=122367] [UPDATE: Count=28, Max=22911, Min=10800, Avg=15891.57, 90=19695, 99=22911, 99.9=22911, 99.99=22911] 
2021-09-12 09:53:48:300 212 sec: 10000 operations; 60.21 current ops/sec; [READ: Count=168, Max=52671, Min=5696, Avg=16560.51, 90=26079, 99=40127, 99.9=52671, 99.99=52671] [CLEANUP: Count=2, Max=10215, Min=17, Avg=5114.5, 90=10215, 99=10215, 99.9=10215, 99.99=10215] [UPDATE: Count=8, Max=20751, Min=11136, Avg=15781, 90=18239, 99=20751, 99.9=20751, 99.99=20751] 
[OVERALL], RunTime(ms), 212923
[OVERALL], Throughput(ops/sec), 46.965334886320406
[TOTAL_GCS_G1_Young_Generation], Count, 7
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 93
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.04367776144427798
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 7
[TOTAL_GC_TIME], Time(ms), 93
[TOTAL_GC_TIME_%], Time(%), 0.04367776144427798
[READ], Operations, 9481
[READ], AverageLatency(us), 19970.544879232148
[READ], MinLatency(us), 5384
[READ], MaxLatency(us), 6500351
[READ], 95thPercentileLatency(us), 30639
[READ], 99thPercentileLatency(us), 51423
[READ], Return=OK, 9481
[CLEANUP], Operations, 2
[CLEANUP], AverageLatency(us), 5114.5
[CLEANUP], MinLatency(us), 17
[CLEANUP], MaxLatency(us), 10215
[CLEANUP], 95thPercentileLatency(us), 10215
[CLEANUP], 99thPercentileLatency(us), 10215
[UPDATE], Operations, 519
[UPDATE], AverageLatency(us), 42215.59152215799
[UPDATE], MinLatency(us), 9832
[UPDATE], MaxLatency(us), 5292031
[UPDATE], 95thPercentileLatency(us), 24271
[UPDATE], 99thPercentileLatency(us), 289279
[UPDATE], Return=OK, 519